dawProject3/app/views/trips/_recent.html.erb

SELECT  "trips".* FROM "trips" WHERE (trips.start_date > '2017-07-09 17:51:51.293626') ORDER BY "trips"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
                        <div class="carousel-inner" role="listbox">
                            <% Trip.recent.each do |trip|%>