dawProject3/app/views/profiles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 8]]
SELECT COUNT(*) FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 8]]
---
                                        <ul class="thread-list" id="trip-list">
											<% if @profile.user.trips.count > 0%>