dawProject3/app/controllers/comments_controller.rb

  def create
    @comment = @trip.comments.new(comment_params)
    @comment.user_id = current_user.id
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("title", "body", "created_at", "updated_at", "user_id", "trip_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "me encanta"], ["body", "eres genial1\r\n"], ["created_at", "2018-01-12 23:14:05.645196"], ["updated_at", "2018-01-12 23:14:05.645196"], ["user_id", 1], ["trip_id", 1]]

    def load_trip
      @trip = Trip.find_by_id(params[:trip_id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]