dawProject3/app/controllers/posts_controller.rb

  def create
    @post = @trip.posts.new(post_params)
    @post.user_id = @trip.user_id
    respond_to do |format|
      if @post.save
        params[:post_attachments]['photo'].each do |photo|
          @post_attachment = @post.post_attachments.create!(:photo => photo)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id", "trip_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdkfhasd"], ["body", "lkhsahfahfklhsafd"], ["created_at", "2018-01-12 13:47:51.004606"], ["updated_at", "2018-01-12 13:47:51.004606"], ["user_id", 8], ["trip_id", 4]]
INSERT INTO "post_attachments" ("post_id", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 2], ["photo", "Foto2.jpg"], ["created_at", "2018-01-13 12:35:16.085255"], ["updated_at", "2018-01-13 12:35:16.085255"]]

    def load_trip
      @trip = Trip.find_by_id(params[:trip_id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]