dawProject3/app/controllers/profiles_controller.rb

    def set_profile
      @profile = Profile.find_by_user_id(params[:user_id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 8], ["LIMIT", 1]]