dawProject3/app/controllers/trips_controller.rb

  def index
    @trips = Trip.all
---
SELECT  "trips".* FROM "trips" WHERE (trips.start_date > '2017-07-09 17:51:51.293626') ORDER BY "trips"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def show
   #redirect_to({action: :index}, notice: 'Viaje no encontrado') unless @trip
    @trip_attachments = @trip.trip_attachments.all
---
SELECT "trip_attachments".* FROM "trip_attachments" WHERE "trip_attachments"."trip_id" = ?  [["trip_id", 1]]

  def edit
	@trip = current_user.trips.find_by_id(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]

  def create
    @trip = current_user.trips.new(trip_params)
    respond_to do |format|
      if @trip.save
        params[:trip_attachments]['photo'].each do |photo|
          @trip_attachment = @trip.trip_attachments.create!(:photo => photo)
---
INSERT INTO "trips" ("from", "where", "start_date", "final_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "trip_attachments" ("trip_id", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["trip_id", 16], ["photo", "fondo.jpg"], ["created_at", "2018-01-13 11:35:40.298522"], ["updated_at", "2018-01-13 11:35:40.298522"]]

  def update
    @trip = current_user.trips.find(params[:id])
    respond_to do |format|
      if @trip.update(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "trips" SET "from" = ?, "start_date" = ?, "final_date" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["from", "Españaaa"], ["start_date", "2018-01-11"], ["final_date", "2018-01-11"], ["updated_at", "2018-01-11 11:42:18.975962"], ["id", 4]]