dawProject3/app/controllers/users_controller.rb

UPDATE "profiles" SET "profile_pic" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["profile_pic", "avatar.jpg"], ["updated_at", "2018-01-12 15:08:11.280164"], ["id", 1]]
---
  def update
    @user = current_user
    respond_to do |format|
      if @user.update(user_params)
        @user.profile.update_attribute("profile_pic", @user.profile_pic)