dawProject3/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "correo@corree.com"], ["hashed_password", "fea7ccd7438d20cf86c9184fc858cb90f6ba3eb8"], ["created_at", "2018-01-08 15:46:38.088863"], ["updated_at", "2018-01-08 15:46:38.088863"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "age" = ?, "profile_pic" = ?, "hashed_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 20], ["profile_pic", "avatar.jpg"], ["hashed_password", "b665e217b51994789b02b1838e730d6b93baa30f"], ["updated_at", "2018-01-12 15:58:47.288232"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)