dawProject3/app/views/posts/_post.html.erb

SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."post_id" = ?  [["post_id", 2]]
---
								<div>
									<% post.post_attachments.each do |p| %>