dawProject3/app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."trip_id" = ?  [["trip_id", 4]]
---
  <tbody>
    <% @trip.posts.each do |post| %>